Revit 2026 API

# LoadBaseOrientTo Property

---

The load orientation option.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LoadOrientTo OrientTo { get; set; }
```
```vb
Public Property OrientTo As LoadOrientTo
	Get
	Set
```
```cpp
public:
property LoadOrientTo OrientTo {
	LoadOrientTo get ();
	void set (LoadOrientTo value);
}
```
```fsharp
member OrientTo : LoadOrientTo with get, set
```

#### Property Value

LoadOrientTo

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: orientTo is not permitted for this type of load. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted. For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted. To determine if load is hosted use IsHosted property.

#### Reference

LoadBase Class

Autodesk.Revit.DB.Structure Namespace